app/views/home/index.html.erb

        <!-- Poll options -->
        <% @active_poll.poll_options.each do |o| %>
---
SELECT  "polls".* FROM "polls" WHERE "polls"."active" = ? ORDER BY "polls"."id" ASC LIMIT ?  [["active", "t"], ["LIMIT", 1]]
SELECT "poll_options".* FROM "poll_options" WHERE "poll_options"."poll_id" = ?  [["poll_id", 1]]