app/views/polls/index.html.erb

      <ul class="poll-options">
        <% poll.poll_options.each do |option| %>
---
SELECT "poll_options".* FROM "poll_options" WHERE "poll_options"."poll_id" = ?  [["poll_id", 12]]
SELECT "polls".* FROM "polls"