app/controllers/home_controller.rb

SELECT  "polls".* FROM "polls" WHERE "polls"."active" = ? ORDER BY "polls"."id" ASC LIMIT ?  [["active", "t"], ["LIMIT", 1]]
---
  def index
    @active_poll = Poll.where(active: true).first