app/controllers/polls_controller.rb

SELECT "polls".* FROM "polls"
---
  def index
    @polls = Poll.all

INSERT INTO "poll_options" ("title", "poll_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "111"], ["poll_id", 1], ["created_at", "2017-11-08 19:30:30.560360"], ["updated_at", "2017-11-08 19:30:30.560360"]]
INSERT INTO "polls" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asdfasfsd"], ["body", "asdfasdfdasf"], ["created_at", "2017-11-09 07:36:39.103493"], ["updated_at", "2017-11-09 07:36:39.103493"]]
---
  def create
    options = params[:poll][:poll_options_string].strip.split(/\s+/).map do |opt|
      PollOption.new(title: opt)
    end

    poll = Poll.new(poll_options: options) do |p|
      p.title = params[:poll][:title]
      p.body = params[:poll][:body]
    end

    poll.save

SELECT  "polls".* FROM "polls" WHERE "polls"."active" = ? ORDER BY "polls"."id" ASC LIMIT ?  [["active", "t"], ["LIMIT", 1]]
UPDATE "polls" SET "active" = ?, "updated_at" = ? WHERE "polls"."id" = ?  [["active", "t"], ["updated_at", "2017-11-09 21:36:55.150929"], ["id", 1]]
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def activate
    unless (poll = Poll.where(active: true)).blank?
      poll.first.update_attribute(:active, false)
    end

    if Poll.find(params[:poll_id]).update_attribute(:active, true)